package com.sklinn.contraceptivechoice.Repositories

import com.sklinn.contraceptivechoice.Model.Result

class SubRepository {
    fun getSubCategory(id: String): Result {
        val subcat = when (id) {
            "1" -> Result("1", "", "1", "", "1", "", "1", "", "4", "", "4", "")
            "2" -> Result("4", "D", "2", "", "3", "", "2", "", "2", "E", "1", "")
            "3" -> Result("4", "DF", "2", "", "3", "", "2", "", "3", "", "3", "")
            "4" -> Result("4", "F", "2", "", "3", "", "2", "", "1", "", "1", "")
            "5" -> Result("3", "G", "1", "", "1", "", "1", "", "1", "", "1", "")
            "6" -> Result("1", "", "1", "", "1", "", "1", "", "2", "", "2", "")
            "7" -> Result("1", "", "1", "", "2", "", "1", "", "2", "", "2", "")
            "8" -> Result("2", "", "2", "", "3", "", "3", "", "4", "A", "4", "A")
            "9" -> Result("1", "", "1", "", "1", "", "1", "", "1", "H", "1", "H")
            "10" -> Result("2", "", "1", "", "2", "", "2", "", "2", "", "1", "")
            "11" -> Result("2", "", "1", "", "2", "", "2", "", "4", "A", "4", "A")
            "12" -> Result("4", "", "4", "", "4", "", "4", "", "4", "", "1", "")
            "13" -> Result("4", "j", "3", "", "3", "", "3", "", "3", "", "1", "")
            "14" -> Result("34", "KA", "1", "", "1", "", "1", "", "1", "", "1", "")
            "15" -> Result("4", "", "2", "", "2", "", "2", "", "2", "", "1", "")
            "16" -> Result("4", "", "s", "L", "3", "L", "3", "L", "3", "L", "1", "")
            "17" -> Result("4", "", "2", "", "2", "", "2", "", "2", "", "1", "")
            "18" -> Result("4", "", "2", "M", "3", "", "2", "M", "2", "M", "1", "")
            "19" -> Result("4", "", "2", "M", "3", "", "2", "M", "2", "M", "1", "")
            "20" -> Result("34", "", "2", "", "3", "", "2", "", "2", "", "1", "")
            "21" -> Result("3", "", "1", "", "2", "", "1", "", "1", "", "1", "")
            "22" -> Result("4", "", "2", "", "3", "", "2", "", "2", "", "1", "")
            "23" -> Result("2", "", "1", "", "1", "P", "1", "", "1", "", "1", "")
            "24" -> Result("2", "Q", "2", "", "2", "Q", "2", "", "2", "", "1", "")
            "25" -> Result("2", "", "1", "", "1", "", "1", "", "1", "", "1", "")
            "26" -> Result("3", "R", "1", "", "1", "", "1", "", "1", "", "1", "")
            "27" -> Result("1", "", "1", "", "1", "", "1", "", "1", "", "1", "")
            "28" -> Result("4", "S", "2", "MS", "2", "M", "2", "M", "2", "M", "1", "")
            "29" -> Result("3", "U", "3", "V", "12", "WV", "2", "V", "1", "", "1", "")
            "30" -> Result("3", "X", "3", "", "12", "W", "2", "", "1", "", "1", "")
            "31" -> Result("12", "Y", "12", "Y", "12", "Y", "12", "Y", "23", "ZA", "23", "ZA")
            "32" -> Result("1", "", "1", "", "1", "", "1", "", "3", "A", "3", "A")
            "33" -> Result("1", "", "1", "", "1", "", "1", "", "4", "A", "4", "A")
            "34" -> Result("1", "", "1", "", "1", "", "1", "", "2", "", "2", "")
            "35" -> Result("1", "", "1", "", "1", "", "1", "", "23", "B", "23", "B")
            else -> Result("1", "", "1", "", "1", "", "1", "", "4", "A", "4", "A")
        }
        return subcat
    }

    fun transformText(text: String): String {
        val completeText = when (text) {
            "1" -> "မည်သည့်အခြေအနေမဆို အသုံးပြုနိင်သောနည်းဖြစ်သည်။"
            "2" -> "ယေဘုယျအားဖြင့် အသုံးပြုနိုင်သော နည်း"
            "3" -> "ပိုမိုသင့်တော်သောနည်းလမ်းများရှိလျှင် ဒီနည်းကို မသုံးစွဲသင့်ပါ"
            "4" -> "ဒီနည်းကို အသုံးမပြုသင့်ပါ။"


            "A" -> "ယခုသားဆက်ခြားနည်းလမ်းအား အသုံးပြုနေစဥ် အခြေအနေတစ်ခုခု ဖြစ်ပေါ်လာပါက ဆေးကုသပြီး ဆက်လက်အသုံးပြုနိုင်ပါသည်"
            "B" -> "အကယ်၍ gonorrohoea သို့ chalamydia ဖြစ်နိုင်ခြေများပါက အခြားပိုမိုသင့်တော်သောနည်းကို ပြောင်းလဲသုံးစွဲပါ"
            "C" -> "ယခင်က မမျိုးပွားလမ်းကြောင်း ပိုးဝင်ဖူးခြင်း၊ သားဆက်ခြားနည်းလမ်းအားလုံး မည်သည့်အချိန်မဆို အသံုးပြုနိုင်ပါသည်"
            "D" -> "အကယ်၍ မီးဖွားပြီး ၃ ပတ်ထက်နည်းသော၊ မိခင်နို့တိုက်ကျွေးခြင်းမရှိ နှင့် အခြားသော သွေးပြန်ကြောသွေးခဲသော ရောဂါဖြစ်စေနိုင်သော အကြောင်းများ မရှိလျှင် အခြား ပိုမိုသင့်တော်သောနည်းကို သုံးစွဲပါ"
            "E" -> "အကယ်၍ မိခင်နို့ တိုက်ကွေျးခြင်း မရှိလျှင် မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်ပါသည်"
            "F" -> "အကယ်၍ မီးဖွားပြီး ၃ ပတ်မှ ၆ ပတ်ထိ၊ မိခင်နို့တိုက်ကျွေးခြင်း မရှိနှင့် အခြားသော သွေးပြန်ကြော သွေးခဲရောသော ရောဂါဖြစ်စေနိုင်သော အကြောင်းများ မရှိလျှင် ပိုမိုသင့်တော်သော နည်းကို သုံးစွဲပါ"
            "G" -> "အကယ်၍ မီးဖွားပြီး ၆ ပတ်အထက်၊ မိခင်နို့တိုက်ကွေျးခြင်း မရှိလျှင် မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်ပါသည်"
            "H" -> "သားအိမ်ပုံမမှတ်၍ ပစ္စည်းထည့်ရန် အခက်ခဲရှပါက ဤနည်းကို အသုံးမပြုရ"
            "I" -> "အသည်းကင်ဆာမဟုတ်သော အကျိတ်နှင့် ကင်ဆာအကျိတ်"
            "J" -> "အကယ်၍ ကင်ဆာမဟုတ်သော အကျိတ်ဖြစ်လျှင် ပိုမိုသင့်တော်သော အခြားနည်းကို သုံးပါ၊ ကင်ဆာအကျိတ်ဖြစ်လျှင် မသုံးသင့်"
            "K" -> "CIC ပိုမိုသင့်တော်သော အခြားနည်းကို သုံးပါ"
            "L" -> "သွေးပြန်ကြောအတွင်း သွေးခဲသော ရောဂါအတွက် ကုထုံးရနေလျှင် ယေဘုယျအားဖြင့် အသုံးပြုနိုင်သောနည်းဖြစ်ပါသည်"
            "M" -> "အခု နည်းလမ်းအားသုံးနေစဥ် တစ်စုံတစ်ခုဖြစ်ပေါ်ပါက အခြားဟော်မုန်းမပါသော သားဆက်ခြားနည်းလမ်းတစ်ခုခုအား ပြောင်းလည်းအသုံးပြုရန် စဥ်းစားပါ"
            "N" -> "ရောဂါဖြစ်စေသည့်အကြောင်းများ - အသက်ကြီဂခြင်း၊ ဆေးလိပ်သောက်ခြင်း၊ ဆီးချို၊ သွေးတိုး၊ အဝလွန်ခြင်းနှင့် သွေးအတွင်းအဆီများခြင်း"
            "O" -> "အကယ်၍ သွေးပေါင်ချိန် တိုင်းတာထားခြင်းမရှိနှင့် ယခင်ကလည်း သွေးတိုးရောဂါ ရာဇဝင်မရှိလျှင် နည်းလမ်းအားလုံးကို အသုံးပြုနိုင်ပါသည်"
            "P" -> "အသက် ၁၈ နှစ်အောက် နှင့် အဝလွန်ခြင်း DMPA/ NET - EN ကို ယေဘုယျအားဖြင့် အသုံပြုနိုင်ပါသည်။"
            "Q" -> "နောက်ဆက်တွဲ ပြသနာရှိသော ဆီးချို သို့မဟုတ် ဆီးချိုရောဂါ အနှစ်နှစ်ဆယ် ကျော်သူများ COC/P/CVR, CIC ၃/၄၊ DMPA, NET-EN ၃"
            "R" -> "တနေ့လျှင် ဆေးလိမ် ၁၅ လိပ်အောက် CIC ယေဘုယျအားဖြင့် သုံးနိုင်၊ တနေ့လျှင် ဆေးလိမ် ၁၅လိပ်နှင့် အထက်ဆိုရင် COC/C/PVR မသုံးသင့်ပါ"
            "S" -> "၃၅နှစ်အောက် အာရံကြော လက္ခဏာမရှိ ခေါင်းတခြမ်းကိုက်ခြင်း COC/C/PVR, CIC ယေဘုယျ အသုံးပြုနိုင်၊ POP အသုံးပြုနိုင်"
            "T" -> "Barbituates, CPZ, Oxcarbazepine, phenytoin, primidone, topiramate and lamotrigine"
            "U" -> "If barbituates, cpz, oxacarbazepine, phenytoin, primidone or topiramate CIC ယေဘုယျ အသုံးပြုနိုင်ပါ"
            "V" -> "IF lamotrigine, မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်ပါသည်"
            "W" -> "DMPA ကို မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်၊ NET-EN ကိုတော့ ယေဘုယျ အသုံပြုနိုင်ပါသည်"
            "X" -> "CICs ကို ယေဘုယျ အသုံးပြုနိုင်ပါ"
            "Y" -> "ARV ဖြင့် ကုသမှု ခံယူနေလျှင် EFV, NVP, ATV, LPV, DRC, RTV: COC/P/CVR, CIC, POP, NET-ET Implants များအား ယေဘုယျအသုံးပြုနိုင်ပါသည်၊ DMPA ကို မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်သည်၊ အားလုံးသော nRTIs, ETR, RPV, RAL များအတွက် နည်းလမ်းအားလုံး မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်သည်"
            "Z" -> "အကယ်၍ HIV, WHO stage 3 or 4 ဆိုရင် IUD အစား အခြားသင့်တော်သော နည်းကို ရွေးချယ်ပါ"

            "DF" -> "အကယ်၍ မီးဖွားပြီး ၃ ပတ်ထက်နည်းသော၊ မိခင်နို့တိုက်ကျွေးခြင်းမရှိ နှင့် အခြားသော သွေးပြန်ကြောသွေးခဲသော ရောဂါဖြစ်စေနိုင်သော အကြောင်းများ မရှိလျှင် အခြား ပိုမိုသင့်တော်သောနည်းကို သုံးစွဲပါ/အကယ်၍ မီးဖွားပြီး ၃ ပတ်မှ ၆ ပတ်ထိ၊ မိခင်နို့တိုက်ကျွေးခြင်း မရှိနှင့် အခြားသော သွေးပြန်ကြော သွေးခဲရောသော ရောဂါဖြစ်စေနိုင်သော အကြောင်းများ မရှိလျှင် ပိုမိုသင့်တော်သော နည်းကို သုံးစွဲပါ "
            "34" ->"ပိုမိုသင့်တော်တာ ပြောင်းသုံး သို့မဟုတ် ဤနည်းကို မသုံးသင့်ပါ"
            "KA" ->"CIC အတွက် ပိုမိုသင့်တော်သော အခြားနည်းကို သုံးပါ/ ယခုသားဆက်ခြားနည်းလမ်းအား အသုံးပြုနေစဥ် အခြေအနေတစ်ခုခု ဖြစ်ပေါ်လာပါက ဆေးကုသပြီး ဆက်လက်အသုံးပြုနိုင်ပါသည်"
            "MS" -> "အခု နည်းလမ်းအားသုံးနေစဥ် တစ်စုံတစ်ခုဖြစ်ပေါ်ပါက အခြားဟော်မုန်းမပါသော သားဆက်ခြားနည်းလမ်းတစ်ခုခုအား ပြောင်းလည်းအသုံးပြုရန် စဥ်းစားပါ/ ၃၅နှစ်အောက် အာရံကြော လက္ခဏာမရှိ ခေါင်းတခြမ်းကိုက်ခြင်း COC/C/PVR, CIC ယေဘုယျ အသုံးပြုနိုင်၊ POP အသုံးပြုနိုင်"
            "12" -> "မည်သည့်အခြေအနေမဆို အသုံးပြုနိင်သောနည်းဖြစ်သည်။/ ယေဘုယျအားဖြင့် အသုံးပြုနိုင်သော နည်း"
            "WV" -> "DMPA ကို မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်၊ NET-EN ကိုတော့ ယေဘုယျ အသုံပြုနိုင်ပါသည်/ IF lamotrigine, မည်သည့်အခြေအနေမဆို အသုံးပြုနိုင်ပါသည်"
            "23" -> "ယေဘုယျအားဖြင့် အသုံးပြုနိုင်သော နည်းဖြစ်သည်/ ပိုမိုသင့်တော်သောနည်းလမ်းများရှိလျှင် ဒီနည်းကို မသုံးစွဲသင့်ပါ"
            "ZA" -> "အကယ်၍ HIV, WHO stage 3 or 4 ဆိုရင် IUD အစား အခြားသင့်တော်သော နည်းကို ရွေးချယ်ပါ/ ယခုသားဆက်ခြားနည်းလမ်းအား အသုံးပြုနေစဥ် အခြေအနေတစ်ခုခု ဖြစ်ပေါ်လာပါက ဆေးကုသပြီး ဆက်လက်အသုံးပြုနိုင်ပါသည် "
            else -> ""
        }
        return completeText
    }
}